############################################
# Task5
# Напишите программу, чтобы проверить, не имеют ли два заданных набора(set) общих элементов.
############################################

import random

s1 = set()
s2 = set()

for _ in range(10):
    s1.add(random.randint(0, 20))
    s2.add(random.randint(0, 20))

s3 = s1 & s2

print("A: ",s1)
print("B: ",s2)
print("Общие элементы: ", s3)

input()